realmcu/HoneyRepo-driver-display/driver/lcdc/src/device/rtl8772f/rtl_lcdc_dbic_reg.h
#ifndef RTL_DBIC_REG_H
#define RTL_DBIC_REG_H

#include <stdint.h>
#include <stdbool.h>
#include "rtl876x.h"

#ifdef  __cplusplus
extern "C" {
#endif /* __cplusplus */

/* ================================================================================ */
/* ============= Refence: DC.xlsx =============== */
/* ================================================================================ */
typedef struct
{
    __IO uint32_t  CTRLR0;                  //0X00
    __IO uint32_t  RX_NDF;                  //0X04
    __IO uint32_t  SSIENR;                  //0X08
    __IO uint32_t  RESERVED[1];             //0X0C
    __IO uint32_t  SER;                     //0X10
    __IO uint32_t  BAUDR;                   //0X14
    __IO uint32_t  TXFTLR;                  //0X18
    __IO uint32_t  RXFTLR;                  //0X1C
    __IO uint32_t  TXFLR;                   //0X20
    __IO uint32_t  RXFLR;                   //0X24
    __IO uint32_t  SR;                      //0X28
    __IO uint32_t  IMR;                     //0X2C
    __IO uint32_t  ISR;                     //0X30
    __IO uint32_t  RISR;                    //0X34
    __IO uint32_t  TXOICR;                  //0X38
    __IO uint32_t  RXOICR;                  //0X3C
    __IO uint32_t  RXUICR;                  //0X40
    __IO uint32_t  MSTICR;                  //0X44
    __IO uint32_t  ICR;                     //0X48
    __IO uint32_t  DMACR;                   //0X4C
    __IO uint32_t  DMATDLR;                 //0X50
    __IO uint32_t  DMARDLR;                 //0X54
    __IO uint32_t  IDR;                     //0X58
    __IO uint32_t  SPIC_VERSION;            //0X5C
    union
    {
        __IO uint8_t  byte;
        __IO uint16_t half;
        __IO uint32_t word;
    } DR[16];                               //0x60-0x9C
    __IO uint32_t  DM_DR[16];               //0XA0-0xDC
    __IO uint32_t  READ_FAST_SINGLE;        //0XE0
    __IO uint32_t  READ_DUAL_DATA;          //0XE4
    __IO uint32_t  READ_DUAL_ADDR_DATA;     //0XE8
    __IO uint32_t  READ_QUAD_DATA;          //0XEC
    __IO uint32_t  READ_QUAD_ADDR_DATA;     //0XF0
    __IO uint32_t  WRITE_SINGLE;            //0XF4
    __IO uint32_t  WRITE_DUAL_DATA;         //0XF8
    __IO uint32_t  WRITE_DUAL_ADDR_DATA;    //0XFC
    __IO uint32_t  WRITE_QUAD_DATA;         //0X100
    __IO uint32_t  WRITE_QUAD_ADDR_DATA;    //0X104
    __IO uint32_t  WRITE_ENABLE;            //0X108
    __IO uint32_t  READ_STATUS;             //0X10C
    __IO uint32_t  CTRLR2;                  //0X110
    __IO uint32_t  FBAUDR;                  //0X114
    __IO uint32_t  USER_LENGTH;             //0X118
    __IO uint32_t  AUTO_LENGTH;             //0X11C
    __IO uint32_t  VALID_CMD;               //0X120
    __IO uint32_t  FLASH_SIZE;              //0X124
    __IO uint32_t  FLUSH_FIFO;              //0X128
    __IO uint32_t  DUM_BYTE;                //0X12C
    __IO uint32_t  TX_NDF;                  //0X130
    __IO uint32_t  DEVICE_INFO;             //0X134
    __IO uint32_t  TPR0;                    //0X138
    __IO uint32_t  AUTO_LENGTH2;            //0X13C
    __IO uint32_t  TPR1;                    //0X140
    __IO uint32_t  RESERVED1[15];            //0x144-0x17C
    __IO uint32_t  ST_DR[16];               //0X180-0x1BC
    __IO uint32_t  STFLR;                   //0X1C0
    __IO uint32_t  RESERVED2[3];            //0x1C4-0x1CC
    __IO uint32_t  PAGE_READ;               //0X1D0
} LCDC_DBIC_TypeDef;

/* 0x00
    4:0     R/W    sipol                   0x1F
    5       R/W    sipol_en                0x0
    6       R/W    scph                    0x0
    7       R/W    scpol                   0x0
    9:8     R/W    tmod                    0x0
    10      R/W    gclk_dis                0x0
    12:11   R      reserved2               0x0
    15:13   R/W    ddr_en                  0x0
    17:16   R/W    addr_ch                 0x0
    19:18   R/W    data_ch                 0x0
    21:20   R/W    cmd_ch                  0x0
    22      R/W    fast_rd                 0x0
    27:23   R/W    ck_mtimes               0x2
    29:28   R      reserved1               0x0
    30      R/W    uar                     0x0
    31      R/W    user_mode               0x0
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        __IO uint32_t sipol: 5;
        __IO uint32_t sipol_en: 1;
        __IO uint32_t scph: 1;
        __IO uint32_t scpol: 1;
        __IO uint32_t tmod: 2;
        __IO uint32_t gclk_dis: 1;
        __I uint32_t reserved_1: 2;
        __IO uint32_t ddr_en: 3;
        __IO uint32_t addr_ch: 2;
        __IO uint32_t data_ch: 2;
        __IO uint32_t cmd_ch: 2;
        __IO uint32_t fast_rd: 1;
        __IO uint32_t ck_mtimes: 5;
        __I uint32_t reserved_0: 2;
        __IO uint32_t uar: 1;
        __IO uint32_t user_mode: 1;
    } b;
} DBIC_CTRLR0_TypeDef;



/* 0x04
    23:0    R/W    rx_ndf                  0x0
    31:24   R      reserved                0x0
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        __IO uint32_t rx_ndf: 24;
        __I uint32_t reserved_0: 8;
    } b;
} DBIC_RX_NDF_TypeDef;



/* 0x08
    0       R/W    spic_en                 0x0
    1       R/W    atck_cmd                0x0
    3:2     R      reserved2               0x0
    4       W      pgm_rst_test_en         0x0
    31:5    R      reserved1               0x0
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        __IO uint32_t spic_en: 1;
        __IO uint32_t atck_cmd: 1;
        __I uint32_t reserved_1: 2;
        __O uint32_t pgm_rst_test_en: 1;
        __I uint32_t reserved_0: 27;
    } b;
} DBIC_SSIENR_TypeDef;



/* 0x10
    0       R/W    ser                     0x1
    31:1    R      reserved                0x0
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        __IO uint32_t ser: 1;
        __I uint32_t reserved_0: 31;
    } b;
} DBIC_SER_TypeDef;



/* 0x14
    11:0    R/W    sckdv                   0x6
    31:12   R      reserved                0x0
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        __IO uint32_t sckdv: 12;
        __I uint32_t reserved_0: 20;
    } b;
} DBIC_BAUDR_TypeDef;



/* 0x18
    5: 0    R/W    tft                     0x0
    31:6    R      reserved                0x0
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        __IO uint32_t tft: 6;
        __I uint32_t reserved_0: 26;
    } b;
} DBIC_TXFTLR_TypeDef;



/* 0x1C
    2: 0    R/W    rft                     0x7
    31:3    R      reserved                0x0
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        __IO uint32_t rft: 3;
        __I uint32_t reserved_0: 29;
    } b;
} DBIC_RXFTLR_TypeDef;



/* 0x20
    6: 0    R      txflr                   0x0
    31: 7   R      reserved                0x0
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        __I uint32_t txflr: 7;
        __I uint32_t reserved_0: 25;
    } b;
} DBIC_TXFLR_TypeDef;



/* 0x24
    3: 0    R      rxflr                   0x0
    31: 4   R      reserved                0x0
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        __I uint32_t rxflr: 4;
        __I uint32_t reserved_0: 28;
    } b;
} DBIC_RXFLR_TypeDef;



/* 0x28
    0       R      busy                    0x0
    1       R      tfnf                    0x1
    2       R      tfe                     0x1
    3       R      rfne                    0x0
    4       R      rff                     0x0
    5       R      txe                     0x0
    6       R      dcol                    0x0
    7       R      boot_fin                0x0
    8       R/W    atwr_rdsr_n             0x0
    31:9    R      reserved                0x0
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        __I uint32_t busy: 1;
        __I uint32_t tfnf: 1;
        __I uint32_t tfe: 1;
        __I uint32_t rfne: 1;
        __I uint32_t rff: 1;
        __I uint32_t txe: 1;
        __I uint32_t dcol: 1;
        __I uint32_t boot_fin: 1;
        __IO uint32_t atwr_rdsr_n: 1;
        __I uint32_t reserved_0: 23;
    } b;
} DBIC_SR_TypeDef;



/* 0x2C
    0       R/W    txeim                   0x0
    1       R/W    txoim                   0x1
    2       R/W    rxuim                   0x1
    3       R/W    rxoim                   0x1
    4       R/W    rxfim                   0x0
    5       R/W    fseim                   0x1
    6       R/W    wbeim                   0x1
    7       R/W    byeim                   0x1
    8       R/W    aceim                   0x1
    9       R/W    useim                   0x0
    10      R/W    tfsim                   0x0
    11      R/W    acsim                   0x0
    12      R/W    dreim                   0x0
    13      R/W    stuim                   0x0
    14      R/W    stoim                   0x0
    15      R/W    stfim                   0x0
    16      R/W    nweim                   0x0
    31:17   R      reserved                0x0
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        __IO uint32_t txeim: 1;
        __IO uint32_t txoim: 1;
        __IO uint32_t rxuim: 1;
        __IO uint32_t rxoim: 1;
        __IO uint32_t rxfim: 1;
        __IO uint32_t fseim: 1;
        __IO uint32_t wbeim: 1;
        __IO uint32_t byeim: 1;
        __IO uint32_t aceim: 1;
        __IO uint32_t useim: 1;
        __IO uint32_t tfsim: 1;
        __IO uint32_t acsim: 1;
        __IO uint32_t dreim: 1;
        __IO uint32_t stuim: 1;
        __IO uint32_t stoim: 1;
        __IO uint32_t stfim: 1;
        __IO uint32_t nweim: 1;
        __I uint32_t reserved_0: 15;
    } b;
} DBIC_IMR_TypeDef;



/* 0x30
    0       R      txeis                   0x0
    1       R      txois                   0x0
    2       R      rxuis                   0x0
    3       R      rxois                   0x0
    4       R      rxfis                   0x0
    5       R      fseis                   0x0
    6       R      wbeis                   0x0
    7       R      byeis                   0x0
    8       R      aceis                   0x0
    9       R      useis                   0x0
    10      R      tfsis                   0x0
    11      R      acsis                   0x0
    12      R      dreis                   0x0
    13      R      stuis                   0x0
    14      R      stois                   0x0
    15      R      stfis                   0x0
    16      R      nweis                   0x0
    31:17   R      reserved                0x0
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        __I uint32_t txeis: 1;
        __I uint32_t txois: 1;
        __I uint32_t rxuis: 1;
        __I uint32_t rxois: 1;
        __I uint32_t rxfis: 1;
        __I uint32_t fseis: 1;
        __I uint32_t wbeis: 1;
        __I uint32_t byeis: 1;
        __I uint32_t aceis: 1;
        __I uint32_t useis: 1;
        __I uint32_t tfsis: 1;
        __I uint32_t acsis: 1;
        __I uint32_t dreis: 1;
        __I uint32_t stuis: 1;
        __I uint32_t stois: 1;
        __I uint32_t stfis: 1;
        __I uint32_t nweis: 1;
        __I uint32_t reserved_0: 15;
    } b;
} DBIC_ISR_TypeDef;



/* 0x34
    0       R      txeir                   0x0
    1       R      txoir                   0x0
    2       R      rxuir                   0x0
    3       R      rxoir                   0x0
    4       R      rxfir                   0x0
    5       R      fseir                   0x0
    6       R      wbeir                   0x0
    7       R      byeir                   0x0
    8       R      aceir                   0x0
    9       R      useir                   0x0
    10      R      tfsir                   0x0
    11      R      acsir                   0x0
    12      R      dreir                   0x0
    13      R      stuir                   0x0
    14      R      stoir                   0x0
    15      R      stfir                   0x0
    16      R      nweir                   0x0
    31:17   R      reserved                0x0
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        __I uint32_t txeir: 1;
        __I uint32_t txoir: 1;
        __I uint32_t rxuir: 1;
        __I uint32_t rxoir: 1;
        __I uint32_t rxfir: 1;
        __I uint32_t fseir: 1;
        __I uint32_t wbeir: 1;
        __I uint32_t byeir: 1;
        __I uint32_t aceir: 1;
        __I uint32_t useir: 1;
        __I uint32_t tfsir: 1;
        __I uint32_t acsir: 1;
        __I uint32_t dreir: 1;
        __I uint32_t stuir: 1;
        __I uint32_t stoir: 1;
        __I uint32_t stfir: 1;
        __I uint32_t nweir: 1;
        __I uint32_t reserved_0: 15;
    } b;
} DBIC_RISR_TypeDef;



